app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    if params[:sort_by] == 'title' || params[:sort_by] == 'release_date'
        @movies = Movie.find(:all, :order => params[:sort_by])
    else
        @movies = Movie.all